public/posts/um-setup-offline.html
<!DOCTYPE html>
<html lang="pt-br">
<head>
<!-- 2025-07-19 sáb 21:10 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Um setup offline</title>
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/svg+xml" href="data:image/svg+xml,&lt;svg xmlns='http://www.w3.org/2000/svg'
	              width='32' height='32'&gt;
	              &lt;polygon points='16,2 30,16 16,30 2,16' fill='%23FFDD33'/&gt;
                      &lt;/svg&gt;">
                     <link rel=icon type="image/webp" href="/fav.webp">
                     <link rel=stylesheet href="/reset.css" />
                     <link rel=stylesheet href="/styles.css" />
</head>
<body>
<div id="preamble" class="status">
<header>
         <nav>
           <div>
             <a href="/">Início</a>
           </div>
           <div>
             <a href="/blog.html">Blog</a>
             <a href="/sobre.html">Sobre</a>
           </div>
         </nav>
       </header>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Um setup offline</h1>
</header><p>
A internet no Brasil é uma coisa&#x2026; "interessante". Interessante na forma do quão cara ela é e também no quão não-confiável e lento o serviço é. E tanto no bom quanto no mau caso, um setup com uma instalação offline do Linux é a melhor opção que você pode ter. Principalmente se esse setup tiver todos os programasque você pode acabar precisando já pré-instalados ou disponíveis para instalação, mesmo sem conexão com a internet.
</p>

<p>
Algo que lembre as antigas distribuições Linux &#x2014; aquelas que vinham em um <i>bundle</i> de CDs de instalação e de programas "extras", como o antigo Debian ou RedHat Linux.
</p>

<p>
Sim. Eu sou um nerd.
</p>

<p>
Enfim.
</p>

<p>
Eu já tenho comigo um setup que cumpre esses requisitos, e para dar aquela
temperada, ele também usa o tema <a href="https://github.com/grassmunk/Chicago95/">Chicago95</a> para combinar com essa "estética retrô".
</p>

<blockquote>
<p>
Só para ser claro, você não precisa ser um nerd como eu para ter um setup assim, na verdade eu recomendo esse tipo de setup para qualquer um. Depender demais no acesso livre à internet é algo que só tende a dar merda no futuro, então é bom ter um plano B.
</p>
</blockquote>

<p>
O meu setup em si é bem "simples" (pelo menos comparado ao tipo de coisa que você vê no <a href="https://www.reddit.com/r/unixporn/">unixporn</a>). Ele usa o <i>desktop environment</i> (eita nome xique) <a href="https://xfce.org/">XFCE</a>, tem alguns utilitários, programas básicos (bloco de notas, calculadora, esse tipo de coisa) e também algumas ferramentas de desenvolvedor como o <a href="https://geany.org">Geany</a> e compiladores como o <a href="https://clang.llvm.org/">Clang</a>. Todos os pacotes, bibliotecas e suas respectivas dependências estão guardados é um diretório do meu HD secundário e também no meu Pendrive.
</p>

<p>
Ao todo, tudo isso dá +/- uns 4.5Gb. Pois é, uma IDE, editores de vídeo e imagem, um navegador de internet, um pacote office completo, entre outras coisas, tudo isso somado é menor que o CoD Mobile.
</p>

<p>
Sendo assim, eu consigo fazer um clone do meu computador de forma extremamente fácil (bom, pelo menos mais fácil do que fazer uma instalação do Windows 11 sem internet), e também consigo utilizar o meu computador sem conexão alguma com a internet, mesmo que isso seja uma situação improvável de acontecer, levando em conta o mundo em que vivemos. Mas ter a segurança de que eu não preciso de internet para o meu computador funcionar/ser útil já é algo que me deixa satisfeito.
</p>

<p>
Experimenta usar um computador com a instalação base do Windows 11 sem internet, é tão útil quanto um <a href="https://www.google.com/intl/pt_br/chromebook/">Chromebook</a> de 2015, e de alguma forma ele fica pior a partir do momento em que ele tem acesso a internet!
</p>

<p>
Eu tenho desde um bloco de notas à uma instalação do TeXLive (<a href="https://www.latex-project.org/">LaTeX</a>).
</p>

<p>
Preciso fazer um TCC? Eu consigo de boa. Fazer uma apresentação de slides?
Tranquilo. Criar um site que lista documentos com base em um banco de dados simples? O <a href="https://jekyllrb.com/">Jekyll</a> já tá pronto para usar.
</p>

<blockquote>
<p>
Opa, pera aí, esse último foi um pouco específico demais 🤔
</p>
</blockquote>

<p>
Num saldo geral, eu consigo me virar até que bem se eu ficar sem acesso à
internet. E isso conta com o lazer também, já que eu tenho um Switch Lite (inclusive, vai tomar no cu, Nintendo! <a href="https://www.nintendo.com/pt-br/store/products/mario-kart-world-switch-2/">R$500 num jogo do Mario</a>? É sério?).
</p>
</div>
</body>
</html>
